/// JMA Weather Forecast Region (Prefecture Forecast Area).
///
/// See IS-QZSS-DCR-015 Table 4.1.2-43.
class JmaWeatherForecastRegion {
  const JmaWeatherForecastRegion._();

  /// Map of weather forecast region codes to names.
  static const regions = <int, String>{
    11000: '宗谷地方',
    12000: '上川・留萌地方',
    12010: '上川地方',
    12020: '留萌地方',
    13000: '網走・北見・紋別地方',
    14010: '根室地方',
    14020: '釧路地方',
    14030: '十勝地方',
    14100: '釧路・根室地方',
    15000: '胆振・日高地方',
    15010: '胆振地方',
    15020: '日高地方',
    16000: '石狩・空知・後志地方',
    16010: '石狩地方',
    16020: '空知地方',
    16030: '後志地方',
    16100: '石狩・空知地方',
    17000: '渡島・檜山地方',
    17010: '渡島地方',
    17020: '檜山地方',
    20000: '青森県',
    30000: '岩手県',
    40000: '宮城県',
    50000: '秋田県',
    60000: '山形県',
    70000: '福島県',
    80000: '茨城県',
    90000: '栃木県',
    100000: '群馬県',
    110000: '埼玉県',
    120000: '千葉県',
    130000: '東京都',
    130010: '東京地方',
    130020: '伊豆諸島北部',
    130030: '伊豆諸島南部',
    140000: '神奈川県',
    150000: '新潟県',
    160000: '富山県',
    170000: '石川県',
    180000: '福井県',
    190000: '山梨県',
    200000: '長野県',
    210000: '岐阜県',
    220000: '静岡県',
    230000: '愛知県',
    240000: '三重県',
    250000: '滋賀県',
    260000: '京都府',
    270000: '大阪府',
    280000: '兵庫県',
    290000: '奈良県',
    300000: '和歌山県',
    310000: '鳥取県',
    320000: '島根県',
    330000: '岡山県',
    340000: '広島県',
    350000: '山口県',
    360000: '徳島県',
    370000: '香川県',
    380000: '愛媛県',
    390000: '高知県',
    400000: '福岡県',
    410000: '佐賀県',
    420000: '長崎県',
    430000: '熊本県',
    440000: '大分県',
    450000: '宮崎県',
    460000: '鹿児島県',
    460040: '奄美地方',
    460100: '鹿児島県(奄美地方除く)',
    471000: '沖縄本島地方',
    472000: '大東島地方',
    473000: '宮古島地方',
    474000: '八重山地方',
    500000: 'その他の府県予報区',
  };

  /// Returns the region name for the given code.
  ///
  /// Returns null if not found.
  static String? fromCode(int code) => regions[code];

  /// Returns a description for undefined codes.
  static String undefinedDescription(int code) => '府県予報区(コード番号：$code)';
}
